MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DX64VMC7/mcu.h
#define AMC                           0x00007F80      // Each bit in the AMC field indicates whether there is a corresponding connection to the AXBS master input port.


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_CR register.
//
//*****************************************************************************

#define SRAMLWP                       0x40000000      // SRAM_L Write Protect
#define SRAMLAP                       0x60000000      // SRAM_L arbitration priority
#define SRAMUWP                       0x18000000      // SRAM_U Write Protect
#define SRAMUAP                       0x06000000      // SRAM_U arbitration priority
#define Reserved                      0x01800000      // Reserved
#define Reserved                      0x00600000      // Reserved
#define Reserved                      0x00180000      // Reserved
#define Reserved                      0x00060000      // Reserved
#define Reserved                      0x00018000      // Reserved
#define Reserved                      0x00006000      // Reserved
#define Reserved                      0x00001800      // Reserved
#define Reserved                      0x00000600      // Reserved
#define Reserved                      0x00000180      // Reserved
#define Reserved                      0x00000060      // Reserved
#define Reserved                      0x00000018      // Reserved
#define Reserved                      0x00000006      // Reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the AXBS_PRSn register.
//
//*****************************************************************************

#define M7                            0x1C0000000      // Master 7 Priority. Sets the arbitration priority for this port on the associated slave port.
#define M6                            0x1C000000      // Master 6 Priority. Sets the arbitration priority for this port on the associated slave port.
#define M5                            0x01C00000      // Master 5 Priority. Sets the arbitration priority for this port on the associated slave port.
#define M4                            0x001C0000      // Master 4 Priority. Sets the arbitration priority for this port on the associated slave port.
#define M3                            0x0001C000      // Master 3 Priority. Sets the arbitration priority for this port on the associated slave port.
#define M2                            0x00001C00      // Master 2 Priority. Sets the arbitration priority for this port on the associated slave port.
#define M1                            0x000001C0      // Master 1 Priority. Sets the arbitration priority for this port on the associated slave port.
#define M0                            0x0000001C      // Master 0 Priority. Sets the arbitration priority for this port on the associated slave port.


//*****************************************************************************
//
// The following are defines for the bit fields in the AXBS_CRSn register.
//
//*****************************************************************************

#define RO                            0x80000000      // Read Only
#define HLP                           0x40000000      // Halt Low Priority
#define ARB                           0x00000600      // Arbitration Mode
#define PCTL                          0x00000060      // Parking Control
#define PARK                          0x0000001C      // Park


//*****************************************************************************
//
// The following are defines for the bit fields in the AXBS_MGPCRn register.
//
//*****************************************************************************

#define AULB                          0x0000001C      // Arbitrates On Undefined Length Bursts


//*****************************************************************************
//
// The following are defines for the bit fields in the AIPSx_MPRA register.
//
//*****************************************************************************

#define MTR0                          0x40000000      // Master Trusted For Read
#define MTW0                          0x20000000      // Master Trusted For Writes
#define MPL0                          0x10000000      // Master Privilege Level
#define MTR1                          0x04000000      // Master trusted for read
#define MTW1                          0x02000000      // Master trusted for writes
#define MPL1                          0x01000000      // Master privilege level
#define MTR2                          0x00400000      // Master Trusted For Read
#define MTW2                          0x00200000      // Master Trusted For Writes
#define MPL2                          0x00100000      // Master Privilege Level


//*****************************************************************************
//
// The following are defines for the bit fields in the AIPSx_PACRn register.
//
//*****************************************************************************

#define SP0                           0x40000000      // Supervisor Protect
#define WP0                           0x20000000      // Write protect
#define TP0                           0x10000000      // Trusted Protect
#define SP1                           0x04000000      // Supervisor Protect
#define WP1                           0x02000000      // Write Protect
#define TP1                           0x01000000      // Trusted protect
#define SP2                           0x00400000      // Supervisor Protect
#define WP2                           0x00200000      // Write protect
#define TP2                           0x00100000      // Trusted Protect
#define SP3                           0x00040000      // Supervisor protect
#define WP3                           0x00020000      // Write Protect
#define TP3                           0x00010000      // Trusted protect
#define SP4                           0x00004000      // Supervisor Protect
#define WP4                           0x00002000      // Write protect
#define TP4                           0x00001000      // Trusted protect
#define SP5                           0x00000400      // Supervisor Protect
#define WP5                           0x00000200      // Write Protect
#define TP5                           0x00000100      // Trusted Protect
#define SP6                           0x00000040      // Supervisor Protect
#define WP6                           0x00000020      // Write Protect
#define TP6                           0x00000010      // Trusted Protect
#define SP7                           0x00000004      // Supervisor Protect
#define WP7                           0x00000002      // Write Protect
#define TP7                           0x00000001      // Trusted Protect


//*****************************************************************************
//
// The following are defines for the bit fields in the DMAMUX_CHCFGn register.
//
//*****************************************************************************

#define ENBL                          0x00000080      // DMA Channel Enable
#define TRIG                          0x00000040      // DMA Channel Trigger Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CR register.
//
//*****************************************************************************

#define CX                            0x00020000      // Cancel Transfer
#define ECX                           0x00010000      // Error Cancel Transfer
#define EMLM                          0x00000080      // Enable Minor Loop Mapping
#define CLM                           0x00000040      // Continuous Link Mode
#define HALT                          0x00000020      // Halt DMA Operations
#define HOE                           0x00000010      // Halt On Error
#define ERCA                          0x00000004      // Enable Round Robin Channel Arbitration
#define EDBG                          0x00000002      // Enable Debug


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_ES register.
//
//*****************************************************************************

#define VLD                           0x80000000      // Logical OR of all ERR status bits
#define ECX                           0x00010000      // Transfer Cancelled
#define CPE                           0x00004000      // Channel Priority Error
#define ERRCHN                        0x00007800      // Error Channel Number or Cancelled Channel Number
#define SAE                           0x00000080      // Source Address Error
#define SOE                           0x00000040      // Source Offset Error
#define DAE                           0x00000020      // Destination Address Error
#define DOE                           0x00000010      // Destination Offset Error
#define NCE                           0x00000008      // NBYTES/CITER Configuration Error
#define SGE                           0x00000004      // Scatter/Gather Configuration Error
#define SBE                           0x00000002      // Source Bus Error
#define DBE                           0x00000001      // Destination Bus Error


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_ERQ register.
//
//*****************************************************************************

